<template>
  <div class="flex items-center h-full w-full p-10">
    <div id="site-one-txt" class="w-1/2">
      <h1 class="text-eva lg:text-3vw text-4vh mix-blend-difference">
        Мой первый сайт.
      </h1>
      <p class="text-noto lg:text-1vw text-1vh">
        Все мы с чего-то начинали. Я, естественно, не исключение. В основном,
        свой путь в FrontEnd-е я начинал с сайта HTMLBook и MDN. Изредка смотрел
        различные видео, для более подробного понимания темы, разве что избегал
        "самые аху### способы". Каждую тему я закреплял на практике, путём
        создания различных элементов сайта, но тогда я не особо переживал по
        поводу исторической ценности своих первых шагов, поэтому почти всё я
        делал на одном сайте. До наших дней сохранилась только финальная версия
        сайта и найденный археологами "Безымянный.png" файл. Думаю, код вам не
        особо интересен, поэтому тут его нет.
      </p>
    </div>
  </div>
</template>

<script setup></script>

<style lang="scss" scoped></style>
